brew "tree"
brew "wget"
brew "trash"
brew "cmake"
brew "tmux"
brew "tmux-fingers"
brew "age"
brew "chezmoi"
brew "mise"
brew "ssh-copy-id"
brew "poppler"
brew "pandoc"
# yazi file manager and its recommended optional deps
# https://yazi-rs.github.io/docs/installation/
brew "yazi"
brew "ffmpeg-full"
brew "sevenzip"
brew "jq"
brew "fd"
brew "ripgrep"
brew "zoxide"
brew "resvg"
brew "imagemagick-full"
tap "johanhaleby/kubetail"
brew "johanhaleby/kubetail/kubetail"
tap "manaflow-ai/cmux"
tap "steipete/tap"
brew "steipete/tap/gogcli"  # Google CLI for Gmail, Calendar, Drive, and Contacts

cask "alt-tab"
cask "cleanmymac"
cask "docker"
cask "dropbox"
cask "google-chrome"
cask "google-japanese-ime"
cask "tailscale"
cask "iterm2"
cask "ghostty"
cask "cmux"
cask "visual-studio-code"
cask "notion"
cask "slack"
cask "raycast"
cask "hammerspoon"
cask "cursor"
cask "keyclu"
cask "claude"
cask "chatgpt"
cask "sublime-text"
cask "discord"
cask "zoom"
cask "azookey"
cask "font-symbols-only-nerd-font"  # glyphs for yazi previews
