brew "tree"
brew "wget"
brew "trash"
brew "node"
brew "cmake"
brew "tmux"
brew "tmux-fingers"
brew "chezmoi"
brew "mise"
brew "volta"
brew "direnv"
brew "ssh-copy-id"
brew "poppler"
brew "pandoc"
brew "k9s"
tap "johanhaleby/kubetail"
brew "johanhaleby/kubetail/kubetail"
tap "steipete/tap"
brew "steipete/tap/gogcli"  # Google CLI for Gmail, Calendar, Drive, and Contacts

cask "alt-tab"
cask "cleanmymac"
cask "docker"
cask "dropbox"
cask "google-chrome"
cask "google-japanese-ime"
cask "tailscale"
cask "iterm2"
cask "ghostty"
cask "visual-studio-code"
cask "notion"
cask "slack"
cask "raycast"
cask "hammerspoon"
cask "cursor"
cask "keyclu"
cask "claude"
cask "chatgpt"
cask "sublime-text"
cask "discord"
cask "zoom"
cask "azookey"
