tap "homebrew/cask"

brew "tree"
brew "wget"
brew "trash"
brew "node"
brew "gh"
brew "cmake"
brew "tmux"
brew "chezmoi"
brew "mise"
brew "direnv"
brew "ssh-copy-id"

cask "alt-tab"
cask "cleanmymac"
cask "docker"
cask "dropbox"
cask "google-chrome"
cask "tailscale"
cask "iterm2"
cask "visual-studio-code"
cask "notion"
cask "slack"
cask "google-cloud-sdk"
cask "raycast"
cask "cursor"
cask "google-japanese-ime"
cask "keyclu"
cask "claude"
cask "chatgpt"
cask "sublime-text"
cask "discord"
cask "zoom"
